Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: وجعلنا فيها جنات من نخيل وأعناب وفجرنا فيها من العيون
en: And We have placed therein gardens of the date-palm and grapes, and We have caused springs of water to gush forth therein,

source: ليأكلوا من ثمره وما عملته أيديهم أفلا يشكرون
en: That they may eat of the fruit thereof, and their hands made it not. Will they not, then, give thanks?

source: سبحان الذي خلق الأزواج كلها مما تنبت الأرض ومن أنفسهم ومما لا يعلمون
en: Glory be to Him Who created all the sexual pairs, of that which the earth groweth, and of themselves, and of that which they know not!

source: وآية لهم الليل نسلخ منه النهار فإذا هم مظلمون
en: A token unto them is night. We strip it of the day, and lo! they are in darkness.

source: والشمس تجري لمستقر لها ذلك تقدير العزيز العليم
en: And the sun runneth on unto a resting-place for him. That is the measuring of the Mighty, the Wise.

source: والقمر قدرناه منازل حتى عاد كالعرجون القديم
en: And for the moon We have appointed mansions till she return like an old shrivelled palm-leaf.

source: لا الشمس ينبغي لها أن تدرك القمر ولا الليل سابق النهار وكل في فلك يسبحون
en: It is not for the sun to overtake the moon, nor doth the night outstrip the day. They float each in an orbit.

source: وآية لهم أنا حملنا ذريتهم في الفلك المشحون
en: And a token unto them is that We bear their offspring in the laden ship,

source: وخلقنا لهم من مثله ما يركبون
en: And have created for them of the like thereof whereon they ride.

source: وإن نشأ نغرقهم فلا صريخ لهم ولا هم ينقذون
en: And if We will, We drown them, and there is no help for them, neither can they be saved;

source: إلا رحمة منا ومتاعا إلى حين
en: Unless by mercy from Us and as comfort for a while.

source: وإذا قيل لهم اتقوا ما بين أيديكم وما خلفكم لعلكم ترحمون
en: When it is said unto them: Beware of that which is before you and that which is behind you, that haply ye may find mercy (they are heedless).

source: وإذا قيل لهم أنفقوا مما رزقكم الله قال الذين كفروا للذين آمنوا أنطعم من لو يشاء الله أطعمه إن أنتم إلا في ضلال مبين
en: And when it is said unto them: Spend of that wherewith Allah hath provided you, those who disbelieve say unto those who believe: Shall we feed those whom Allah, if He willed, would feed? Ye are in naught else than error manifest.

source: ما ينظرون إلا صيحة واحدة تأخذهم وهم يخصمون
en: They await but one Shout, which will surprise them while they are disputing.

source: فلا يستطيعون توصية ولا إلى أهلهم يرجعون
en: Then they cannot make bequest, nor can they return to their own folk.

source: ونفخ في الصور فإذا هم من الأجداث إلى ربهم ينسلون
en: And the trumpet is blown and lo! from the graves they hie unto their Lord,

source: قالوا يا ويلنا من بعثنا من مرقدنا هذا ما وعد الرحمن وصدق المرسلون
en: Crying: Woe upon us! Who hath raised us from our place of sleep? This is that which the Beneficent did promise, and the messengers spoke truth.

source: إن كانت إلا صيحة واحدة فإذا هم جميع لدينا محضرون
en: It is but one Shout, and behold them brought together before Us!

source: فاليوم لا تظلم نفس شيئا ولا تجزون إلا ما كنتم تعملون
en: This day no soul is wronged in aught; nor are ye requited aught save what ye used to do.

source: إن أصحاب الجنة اليوم في شغل فاكهون
en: Lo! those who merit paradise this day are happily employed,

source: هم وأزواجهم في ظلال على الأرائك متكئون
en: They and their wives, in pleasant shade, on thrones reclining;

source: لهم فيها فاكهة ولهم ما يدعون
en: Theirs the fruit (of their good deeds) and theirs (all) that they ask;

source: سلام قولا من رب رحيم
en: The word from a Merciful Lord (for them) is: Peace!

source: وامتازوا اليوم أيها المجرمون
en: But avaunt ye, O ye guilty, this day!

source: ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان إنه لكم عدو مبين
en: Did I not charge you, O ye sons of Adam, that ye worship not the devil - Lo! he is your open foe! -

source: وأن اعبدوني هذا صراط مستقيم
en: But that ye worship Me? That was the right path.

source: ولقد أضل منكم جبلا كثيرا أفلم تكونوا تعقلون
en: Yet he hath led astray of you a great multitude. Had ye then no sense?

source: هذه جهنم التي كنتم توعدون
en: This is hell which ye were promised (if ye followed him).

source: اصلوها اليوم بما كنتم تكفرون
en: Burn therein this day for that ye disbelieved.

source: اليوم نختم على أفواههم وتكلمنا أيديهم وتشهد أرجلهم بما كانوا يكسبون
en: This day We seal up their mouths, and their hands speak out to Us and their feet bear witness as to what they used to earn.

source: ولو نشاء لطمسنا على أعينهم فاستبقوا الصراط فأنى يبصرون
en: And had We willed, We verily could have quenched their eyesight so that they should struggle for the way. Then how could they have seen?

source: ولو نشاء لمسخناهم على مكانتهم فما استطاعوا مضيا ولا يرجعون
en: And had We willed, We verily could have fixed them in their place, making them powerless to go forward or turn back.

source: ومن نعمره ننكسه في الخلق أفلا يعقلون
en: He whom we bring unto old age, We reverse him in creation (making him go back to weakness after strength). Have ye then no sense?

source: وما علمناه الشعر وما ينبغي له إن هو إلا ذكر وقرآن مبين
en: And We have not taught him (Muhammad) poetry, nor is it meet for him. This is naught else than a Reminder and a Lecture making plain,

source: لينذر من كان حيا ويحق القول على الكافرين
en: To warn whosoever liveth, and that the word may be fulfilled against the disbelievers.

source: أولم يروا أنا خلقنا لهم مما عملت أيدينا أنعاما فهم لها مالكون
en: Have they not seen how We have created for them of Our handiwork the cattle, so that they are their owners,

source: وذللناها لهم فمنها ركوبهم ومنها يأكلون
en: And have subdued them unto them, so that some of them they have for riding, some for food?

source: ولهم فيها منافع ومشارب أفلا يشكرون
en: Benefits and (divers) drinks have they from them. Will they not then give thanks?

source: واتخذوا من دون الله آلهة لعلهم ينصرون
en: And they have taken (other) gods beside Allah, in order that they may be helped.

source: لا يستطيعون نصرهم وهم لهم جند محضرون
en: It is not in their power to help them; but they (the worshippers) are unto them a host in arms.

source: فلا يحزنك قولهم إنا نعلم ما يسرون وما يعلنون
en: So let not their speech grieve thee (O Muhammad). Lo! We know what they conceal and what proclaim.

source: أولم ير الإنسان أنا خلقناه من نطفة فإذا هو خصيم مبين
en: Hath not man seen that We have created him from a drop of seed? Yet lo! he is an open opponent.

source: وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم
en: And he hath coined for Us a similitude, and hath forgotten the fact of his creation, saying: Who will revive these bones when they have rotted away?

source: قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم
en: Say: He will revive them Who produced them at the first, for He is Knower of every creation,

source: الذي جعل لكم من الشجر الأخضر نارا فإذا أنتم منه توقدون
en: Who hath appointed for you fire from the green tree, and behold! ye kindle from it.

source: أوليس الذي خلق السماوات والأرض بقادر على أن يخلق مثلهم بلى وهو الخلاق العليم
en: Is not He Who created the heavens and the earth Able to create the like of them? Aye, that He is! for He is the All-Wise Creator,

source: إنما أمره إذا أراد شيئا أن يقول له كن فيكون
en: But His command, when He intendeth a thing, is only that He saith unto it: Be! and it is.

source: فسبحان الذي بيده ملكوت كل شيء وإليه ترجعون
en: Therefor Glory be to Him in Whose hand is the dominion over all things! Unto Him ye will be brought back.

source: والصافات صفا
en: By those who set the ranks in battle order

source: فالزاجرات زجرا
en: And those who drive away (the wicked) with reproof

source: فالتاليات ذكرا
en: And those who read (the Word) for a reminder,

source: إن إلهكم لواحد
en: Lo! thy Lord is surely One;

source: رب السماوات والأرض وما بينهما ورب المشارق
en: Lord of the heavens and of the earth and all that is between them, and Lord of the sun's risings.

source: إنا زينا السماء الدنيا بزينة الكواكب
en: Lo! We have adorned the lowest heaven with an ornament, the planets;

source: وحفظا من كل شيطان مارد
en: With security from every froward devil.

source: لا يسمعون إلى الملإ الأعلى ويقذفون من كل جانب
en: They cannot listen to the Highest Chiefs for they are pelted from every side,

source: دحورا ولهم عذاب واصب
en: Outcast, and theirs is a perpetual torment;

source: إلا من خطف الخطفة فأتبعه شهاب ثاقب
en: Save him who snatcheth a fragment, and there pursueth him a piercing flame.

source: فاستفتهم أهم أشد خلقا أم من خلقنا إنا خلقناهم من طين لازب
en: Then ask them (O Muhammad): Are they stronger as a creation, or those (others) whom we have created? Lo! We created them of plastic clay.

source: بل عجبت ويسخرون
en: Nay, but thou dost marvel when they mock

source: وإذا ذكروا لا يذكرون
en: And heed not when they are reminded,

source: وإذا رأوا آية يستسخرون
en: And seek to scoff when they behold a portent.

source: وقالوا إن هذا إلا سحر مبين
en: And they say: Lo! this is mere magic;

source: أإذا متنا وكنا ترابا وعظاما أإنا لمبعوثون
en: When we are dead and have become dust and bones, shall we then, forsooth, be raised (again)?

source: أوآباؤنا الأولون
en: And our forefathers?

source: قل نعم وأنتم داخرون
en: Say (O Muhammad): Ye, in truth; and ye will be brought low.

source: فإنما هي زجرة واحدة فإذا هم ينظرون
en: There is but one Shout, and lo! they behold,

source: وقالوا يا ويلنا هذا يوم الدين
en: And say: Ah, woe for us! This is the Day of Judgment.

source: هذا يوم الفصل الذي كنتم به تكذبون
en: This is the Day of Separation, which ye used to deny.

source: احشروا الذين ظلموا وأزواجهم وما كانوا يعبدون
en: (And it is said unto the angels): Assemble those who did wrong, together with their wives and what they used to worship

source: من دون الله فاهدوهم إلى صراط الجحيم
en: Instead of Allah, and lead them to the path to hell;

source: وقفوهم إنهم مسئولون
en: And stop them, for they must be questioned.

source: ما لكم لا تناصرون
en: What aileth you that ye help not one another?

source: بل هم اليوم مستسلمون
en: Nay, but this day they make full submission.

source: وأقبل بعضهم على بعض يتساءلون
en: And some of them draw near unto others, mutually questioning.

source: قالوا إنكم كنتم تأتوننا عن اليمين
en: They say: Lo! ye used to come unto us, imposing, (swearing that ye spoke the truth).

source: قالوا بل لم تكونوا مؤمنين
en: They answer: Nay, but ye (yourselves) were not believers.

source: وما كان لنا عليكم من سلطان بل كنتم قوما طاغين
en: We had no power over you, but ye were wayward folk.

source: فحق علينا قول ربنا إنا لذائقون
en: Now the Word of our Lord hath been fulfilled concerning us. Lo! we are about to taste (the doom).

source: فأغويناكم إنا كنا غاوين
en: Thus we misled you. Lo! we were (ourselves) astray.

source: فإنهم يومئذ في العذاب مشتركون
en: Then lo! this day they (both) are sharers in the doom.

source: إنا كذلك نفعل بالمجرمين
en: Lo! thus deal We with the guilty.

source: إنهم كانوا إذا قيل لهم لا إله إلا الله يستكبرون
en: For when it was said unto them, There is no Allah save Allah, they were scornful

source: ويقولون أئنا لتاركو آلهتنا لشاعر مجنون
en: And said: Shall we forsake our gods for a mad poet?

source: بل جاء بالحق وصدق المرسلين
en: Nay, but he brought the Truth, and he confirmed those sent (before him).

source: إنكم لذائقو العذاب الأليم
en: Lo! (now) verily ye taste the painful doom -

source: وما تجزون إلا ما كنتم تعملون
en: Ye are requited naught save what ye did -

source: إلا عباد الله المخلصين
en: Save single-minded slaves of Allah;

source: أولئك لهم رزق معلوم
en: For them there is a known provision,

source: فواكه وهم مكرمون
en: Fruits. And they will be honoured

source: في جنات النعيم
en: In the Gardens of delight,

source: على سرر متقابلين
en: On couches facing one another;

source: يطاف عليهم بكأس من معين
en: A cup from a gushing spring is brought round for them,

source: بيضاء لذة للشاربين
en: White, delicious to the drinkers,

source: لا فيها غول ولا هم عنها ينزفون
en: Wherein there is no headache nor are they made mad thereby.

source: وعندهم قاصرات الطرف عين
en: And with them are those of modest gaze, with lovely eyes,

source: كأنهن بيض مكنون
en: (Pure) as they were hidden eggs (of the ostrich).

source: فأقبل بعضهم على بعض يتساءلون
en: And some of them draw near unto others, mutually questioning.

source: قال قائل منهم إني كان لي قرين
en: A speaker of them saith: Lo! I had a comrade

source: يقول أإنك لمن المصدقين
en: Who used to say: Art thou in truth of those who put faith (in his words)?

source: أإذا متنا وكنا ترابا وعظاما أإنا لمدينون
en: Can we, when we are dead and have become mere dust and bones - can we (then) verily be brought to book?

source: قال هل أنتم مطلعون
en: He saith: Will ye look?

source: فاطلع فرآه في سواء الجحيم
en: Then looketh he and seeth him in the depth of hell.

source: قال تالله إن كدت لتردين
en: He saith: By Allah, thou verily didst all but cause my ruin,

source: ولولا نعمة ربي لكنت من المحضرين
en: And had it not been for the favour of my Lord, I too had been of those haled forth (to doom).

source: أفما نحن بميتين
en: Are we then not to die

source: إلا موتتنا الأولى وما نحن بمعذبين
en: Saving our former death, and are we not to be punished?

source: إن هذا لهو الفوز العظيم
en: Lo! this is the supreme triumph.

source: لمثل هذا فليعمل العاملون
en: For the like of this, then, let the workers work.

source: أذلك خير نزلا أم شجرة الزقوم
en: Is this better as a welcome, or the tree of Zaqqum?

source: إنا جعلناها فتنة للظالمين
en: Lo! We have appointed it a torment for wrong-doers.

source: إنها شجرة تخرج في أصل الجحيم
en: Lo! it is a tree that springeth in the heart of hell.

source: طلعها كأنه رءوس الشياطين
en: Its crop is as it were the heads of devils

source: فإنهم لآكلون منها فمالئون منها البطون
en: And lo! they verily must eat thereof, and fill (their) bellies therewith.

source: ثم إن لهم عليها لشوبا من حميم
en: And afterward, lo! thereupon they have a drink of boiling water

source: ثم إن مرجعهم لإلى الجحيم
en: And afterward, lo! their return is surely unto hell.

source: إنهم ألفوا آباءهم ضالين
en: They indeed found their fathers astray,

source: فهم على آثارهم يهرعون
en: But they make haste (to follow) in their footsteps.

source: ولقد ضل قبلهم أكثر الأولين
en: And verily most of the men of old went astray before them,

source: ولقد أرسلنا فيهم منذرين
en: And verily We sent among them warners.

source: فانظر كيف كان عاقبة المنذرين
en: Then see the nature of the consequence for those warned,

source: ولقد نادانا نوح فلنعم المجيبون
en: And Noah verily prayed unto Us, and gracious was the Hearer of his prayer

source: ونجيناه وأهله من الكرب العظيم
en: And We saved him and his household from the great distress,

source: وجعلنا ذريته هم الباقين
en: And made his seed the survivors,

source: وتركنا عليه في الآخرين
en: And left for him among the later folk (the salutation):

source: سلام على نوح في العالمين
en: Peace be unto Noah among the peoples!

source: إنا كذلك نجزي المحسنين
en: Lo! thus do We reward the good.

source: إنه من عبادنا المؤمنين
en: Lo! he is one of Our believing slaves.

source: وإن من شيعته لإبراهيم
en: And lo! of his persuasion verily was Abraham

source: إذ جاء ربه بقلب سليم
en: When he came unto his Lord with a whole heart;

source: إذ قال لأبيه وقومه ماذا تعبدون
en: When he said unto his father and his folk: What is it that ye worship?

source: أئفكا آلهة دون الله تريدون
en: Is it a falsehood - gods beside Allah - that ye desire?

source: فما ظنكم برب العالمين
en: What then is your opinion of the Lord of the Worlds?

source: فنظر نظرة في النجوم
en: And he glanced a glance at the stars

source: فقال إني سقيم
en: Then said: Lo! I feel sick!

source: فتولوا عنه مدبرين
en: And they turned their backs and went away from him.

source: فراغ إلى آلهتهم فقال ألا تأكلون
en: Then turned he to their gods and said: Will ye not eat?

source: ما لكم لا تنطقون
en: What aileth you that ye speak not?

source: فراغ عليهم ضربا باليمين
en: Then he attacked them, striking with his right hand.

source: فأقبلوا إليه يزفون
en: And (his people) came toward him, hastening.

source: قال أتعبدون ما تنحتون
en: He said: Worship ye that which ye yourselves do carve

source: والله خلقكم وما تعملون
en: When Allah hath created you and what ye make?

source: قالوا ابنوا له بنيانا فألقوه في الجحيم
en: They said: Build for him a building and fling him in the red-hotfire.

source: فأرادوا به كيدا فجعلناهم الأسفلين
en: And they designed a snare for him, but We made them the undermost.

source: وقال إني ذاهب إلى ربي سيهدين
en: And he said: Lo! I am going unto my Lord Who will guide me.

source: رب هب لي من الصالحين
en: My Lord! Vouchsafe me of the righteous.

source: فبشرناه بغلام حليم
en: So We gave him tidings of a gentle son.

source: فلما بلغ معه السعي قال يا بني إني أرى في المنام أني أذبحك فانظر ماذا ترى قال يا أبت افعل ما تؤمر ستجدني إن شاء الله من الصابرين
en: And when (his son) was old enough to walk with him, (Abraham) said: O my dear son, I have seen in a dream that I must sacrifice thee. So look, what thinkest thou? He said: O my father! Do that which thou art commanded. Allah willing, thou shalt find me of the steadfast.

source: فلما أسلما وتله للجبين
en: Then, when they had both surrendered (to Allah), and he had flung him down upon his face,

source: وناديناه أن يا إبراهيم
en: We called unto him: O Abraham!

source: قد صدقت الرؤيا إنا كذلك نجزي المحسنين
en: Thou hast already fulfilled the vision. Lo! thus do We reward the good.

source: إن هذا لهو البلاء المبين
en: Lo! that verily was a clear test.

source: وفديناه بذبح عظيم
en: Then We ransomed him with a tremendous victim.

source: سلام على إبراهيم
en: Peace be unto Abraham!

source: كذلك نجزي المحسنين
en: Thus do We reward the good.

source: وبشرناه بإسحاق نبيا من الصالحين
en: And we gave him tidings of the birth of Isaac, a prophet of the righteous.

source: وباركنا عليه وعلى إسحاق ومن ذريتهما محسن وظالم لنفسه مبين
en: And We blessed him and Isaac. And of their seed are some who do good, and some who plainly wrong themselves.

source: ولقد مننا على موسى وهارون
en: And We verily gave grace unto Moses and Aaron,

source: ونجيناهما وقومهما من الكرب العظيم
en: And saved them and their people from the great distress,

source: ونصرناهم فكانوا هم الغالبين
en: And helped them so that they became the victors.

source: وآتيناهما الكتاب المستبين
en: And We gave them the clear Scripture

source: وهديناهما الصراط المستقيم
en: And showed them the right path.

source: وتركنا عليهما في الآخرين
en: And We left for them among the later folk (the salutation):

source: سلام على موسى وهارون
en: Peace be unto Moses and Aaron!

source: إنهما من عبادنا المؤمنين
en: Lo! they are two of Our believing slaves.

source: وإن إلياس لمن المرسلين
en: And lo! Elias was of those sent (to warn),

source: إذ قال لقومه ألا تتقون
en: When he said unto his folk: Will ye not ward off (evil)?

source: أتدعون بعلا وتذرون أحسن الخالقين
en: Will ye cry unto Baal and forsake the Best of creators,

source: الله ربكم ورب آبائكم الأولين
en: Allah, your Lord and Lord of your forefathers?

source: فكذبوه فإنهم لمحضرون
en: But they denied him, so they surely will be haled forth (to the doom)

source: سلام على إل ياسين
en: Peace be unto Elias!

source: وإن لوطا لمن المرسلين
en: And lo! Lot verily was of those sent (to warn).

source: إذ نجيناه وأهله أجمعين
en: When We saved him and his household, every one,

source: وإنكم لتمرون عليهم مصبحين
en: And lo! ye verily pass by (the ruin of) them in the morning

source: وبالليل أفلا تعقلون
en: And at night-time; have ye then no sense?

source: وإن يونس لمن المرسلين
en: And lo! Jonah verily was of those sent (to warn)

source: إذ أبق إلى الفلك المشحون
en: When he fled unto the laden ship,

source: فساهم فكان من المدحضين
en: And then drew lots and was of those rejected;

source: فالتقمه الحوت وهو مليم
en: And the fish swallowed him while he was blameworthy;

source: فلولا أنه كان من المسبحين
en: And had he not been one of those who glorify (Allah)

source: للبث في بطنه إلى يوم يبعثون
en: He would have tarried in its belly till the day when they are raised;

source: فنبذناه بالعراء وهو سقيم
en: Then We cast him on a desert shore while he was sick;

source: وأنبتنا عليه شجرة من يقطين
en: And We caused a tree of gourd to grow above him;

source: وأرسلناه إلى مائة ألف أو يزيدون
en: And We sent him to a hundred thousand (folk) or more

source: فآمنوا فمتعناهم إلى حين
en: And they believed, therefor We gave them comfort for a while.

source: فاستفتهم ألربك البنات ولهم البنون
en: Now ask them (O Muhammad): Hath thy Lord daughters whereas they have sons?

source: أم خلقنا الملائكة إناثا وهم شاهدون
en: Or created We the angels females while they were present?

source: ألا إنهم من إفكهم ليقولون
en: Lo! it is of their falsehood that they say:

source: ولد الله وإنهم لكاذبون
en: Allah hath begotten. Allah! verily they tell a lie.

source: أصطفى البنات على البنين
en: (And again of their falsehood): He hath preferred daughters to sons.

source: ما لكم كيف تحكمون
en: What aileth you? How judge ye?

source: أفلا تذكرون
en: Will ye not then reflect?

source: أم لكم سلطان مبين
en: Or have ye a clear warrant?

source: فأتوا بكتابكم إن كنتم صادقين
en: Then produce your writ, if ye are truthful.

source: وجعلوا بينه وبين الجنة نسبا ولقد علمت الجنة إنهم لمحضرون
en: And they imagine kinship between him and the jinn, whereas the jinn know well that they will be brought before (Him).

source: سبحان الله عما يصفون
en: Glorified be Allah from that which they attribute (unto Him),

source: فإنكم وما تعبدون
en: Lo! verily, ye and that which ye worship,

source: ما أنتم عليه بفاتنين
en: Ye cannot excite (anyone) against Him.

source: إلا من هو صال الجحيم
en: Save him who is to burn in hell.

source: وما منا إلا له مقام معلوم
en: There is not one of us but hath his known position.

source: وإنا لنحن الصافون
en: Lo! we, even we are they who set the ranks,

source: وإنا لنحن المسبحون
en: Lo! we, even we are they who hymn His praise

source: وإن كانوا ليقولون
en: And indeed they used to say:

source: لو أن عندنا ذكرا من الأولين
en: If we had but a reminder from the men of old

source: لكنا عباد الله المخلصين
en: We would be single-minded slaves of Allah.

source: فكفروا به فسوف يعلمون
en: Yet (now that it is come) they disbelieve therein; but they will come to know.

source: ولقد سبقت كلمتنا لعبادنا المرسلين
en: And verily Our word went forth of old unto Our bondmen sent (to warn)

source: إنهم لهم المنصورون
en: That they verily would be helped,

source: وإن جندنا لهم الغالبون
en: And that Our host, they verily would be the victors.

source: فتول عنهم حتى حين
en: So withdraw from them (O Muhammad) awhile,

source: وأبصرهم فسوف يبصرون
en: And watch, for they will (soon) see.

source: فإذا نزل بساحتهم فساء صباح المنذرين
en: But when it cometh home to them, then it will be a hapless morn for those who have been warned.

source: وتول عنهم حتى حين
en: Withdraw from them awhile

source: وأبصر فسوف يبصرون
en: And watch, for they will (soon) see.

source: سبحان ربك رب العزة عما يصفون
en: Glorified be thy Lord, the Lord of Majesty, from that which they attribute (unto Him)

source: وسلام على المرسلين
en: And peace be unto those sent (to warn).

source: والحمد لله رب العالمين
en: And praise be to Allah, Lord of the Worlds!

source: ص والقرآن ذي الذكر
en: Sad. By the renowned Qur'an,

source: بل الذين كفروا في عزة وشقاق
en: Nay, but those who disbelieve are in false pride and schism.

source: كم أهلكنا من قبلهم من قرن فنادوا ولات حين مناص
en: How many a generation We destroyed before them, and they cried out when it was no longer the time for escape!

source: وعجبوا أن جاءهم منذر منهم وقال الكافرون هذا ساحر كذاب
en: And they marvel that a warner from among themselves hath come unto them, and the disbelievers say: This is a wizard, a charlatan.
